[Killed] BlockStatement
main/components/TabComponent/StaffTabComponent.jsx:62:29
     staffPostMutation.mutate(staff);
   };
 
-  const downloadCsv = () => {
-    window.open(`/api/csv/coursestaff?courseId=${courseId}`, "_blank");
-  };
+  const downloadCsv = () => {};
 
   const openCsvHelp = () => {
killedBy: StaffTabComponent Tests Download Staff CSV button calls window.open with correct URL
statusReason: expected "vi.fn()" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class=""
    style=""

[Killed] StringLiteral
main/components/TabComponent/StaffTabComponent.jsx:63:17
   };
 
   const downloadCsv = () => {
-    window.open(`/api/csv/coursestaff?courseId=${courseId}`, "_blank");
+    window.open(``, "_blank");
   };
 
killedBy: StaffTabComponent Tests Download Staff CSV button calls window.open with correct URL
statusReason: expected "vi.fn()" to be called with arguments: [ …(2) ]

Received:

  1st vi.fn() call:

  [
-   "/api/csv/coursestaff?courseId=7",

[Killed] BlockStatement
main/components/TabComponent/StaffTabComponent.jsx:66:29
     window.open(`/api/csv/coursestaff?courseId=${courseId}`, "_blank");
   };
 
-  const openCsvHelp = () => {
-    window.open("/help/csv#staff-csv-download", "_blank");
-  };
+  const openCsvHelp = () => {};
 
   // Render tooltip for disabled buttons
killedBy: StaffTabComponent Tests Help icon on Download Staff CSV opens help page
statusReason: expected "vi.fn()" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class=""
    style=""
