[Timeout] ArrayDeclaration
main/components/Courses/CourseWarningBanner.jsx:6:5
 
 export function CourseWarningBanner({ courseId, orgName }) {
   const { data: warnings } = useBackend(
-    [`/api/courses/warnings/${courseId}`],
+    [],
     {
       method: "GET",

[Killed] StringLiteral
main/components/Courses/CourseWarningBanner.jsx:9:12
     [`/api/courses/warnings/${courseId}`],
     {
       method: "GET",
-      url: `/api/courses/warnings/${courseId}`,
+      url: ``,
     },
     undefined,
killedBy: InstructorCourseShowPage tests header displays correct info when course is loaded (and displays warning)
statusReason: Unable to find an element with the text: /This GitHub Organization/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Timeout] ObjectLiteral
main/components/Courses/CourseWarningBanner.jsx:13:5
     },
     undefined,
     true,
-    {
-      placeholderData: { showOrganizationAgeWarning: false },
-      staleTime: "static",
-    },
+    {},
   );
 

[Killed] BooleanLiteral
main/components/Courses/CourseWarningBanner.jsx:14:54
     undefined,
     true,
     {
-      placeholderData: { showOrganizationAgeWarning: false },
+      placeholderData: { showOrganizationAgeWarning: true },
       staleTime: "static",
     },
killedBy: CourseWarningBanner tests renders warning banner on warning return
statusReason: expected "useBackend" to be called with arguments: [ [ '/api/courses/warnings/1' ], …(4) ]

Received:

  1st useBackend call:

@@ -8,10 +8,10 @@
    },

[Killed] OptionalChaining
main/components/Courses/CourseWarningBanner.jsx:19:22
     },
   );
 
-  const permission = warnings?.defaultBasePermission;
+  const permission = warnings.defaultBasePermission;
   const showPermissionWarning =
     permission && permission !== "none" && permission !== "null";
killedBy: InstructorCourseShowPage tests Cleans up correctly on unmount
statusReason: Unable to find an element with the text: Course not found. You will be returned to the course list in 3 seconds.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div />

[Killed] ConditionalExpression
main/components/Courses/CourseWarningBanner.jsx:21:19
 
   const permission = warnings?.defaultBasePermission;
   const showPermissionWarning =
-    permission && permission !== "none" && permission !== "null";
+    permission && true && permission !== "null";
 
   return (
killedBy: CourseWarningBanner tests Does not render banner on false
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="fade alert alert-warning show"
  role="alert"
>
  Warning: The default base permission for this organization is 
  "None"

[Killed] EqualityOperator
main/components/Courses/CourseWarningBanner.jsx:21:19
 
   const permission = warnings?.defaultBasePermission;
   const showPermissionWarning =
-    permission && permission !== "none" && permission !== "null";
+    permission && permission === "none" && permission !== "null";
 
   return (
killedBy: CourseWarningBanner tests Does not render banner on false
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="fade alert alert-warning show"
  role="alert"
>
  Warning: The default base permission for this organization is 
  "None"

[Killed] ConditionalExpression
main/components/Courses/CourseWarningBanner.jsx:25:8
 
   return (
     <>
-      {warnings?.showOrganizationAgeWarning && (
-        <Alert variant="warning">
-          Warning: This GitHub Organization is less than 30 days old. You will
-          experience difficulties enrolling more than 50 students in a day.
-        </Alert>
-      )}
+      {true}
       {showPermissionWarning && (
         <Alert variant="warning">
killedBy: InstructorCourseShowPage tests header displays correct info when course is loaded (and displays warning)
statusReason: Unable to find an element with the text: /This GitHub Organization/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] LogicalOperator
main/components/Courses/CourseWarningBanner.jsx:31:8
           experience difficulties enrolling more than 50 students in a day.
         </Alert>
       )}
-      {showPermissionWarning && (
-        <Alert variant="warning">
-          Warning: The default base permission for this organization is&nbsp;
-          {`"${permission.charAt(0).toUpperCase() + permission.slice(1)}"`}.
-          Students may be able to view one another&apos;s private repos.&nbsp;
-          {orgName && (
-            <Alert.Link
-              href={`https://github.com/organizations/${orgName}/settings/member_privileges`}
-              target="_blank"
-              rel="noopener noreferrer"
-            >
-              Change this in GitHub settings.
-            </Alert.Link>
-          )}
-        </Alert>
-      )}
+      {showPermissionWarning || <Alert variant="warning">
+          Warning: The default base permission for this organization is&nbsp;
+          {`"${permission.charAt(0).toUpperCase() + permission.slice(1)}"`}.
+          Students may be able to view one another&apos;s private repos.&nbsp;
+          {orgName && <Alert.Link href={`https://github.com/organizations/${orgName}/settings/member_privileges`} target="_blank" rel="noopener noreferrer">
+              Change this in GitHub settings.
+            </Alert.Link>}
+        </Alert>}
     </>
   );
killedBy: InstructorCourseShowPage tests renders correctly for instructor user
statusReason: Cannot read properties of undefined (reading 'charAt')

[Killed] ConditionalExpression
main/components/Courses/CourseWarningBanner.jsx:31:8
           experience difficulties enrolling more than 50 students in a day.
         </Alert>
       )}
-      {showPermissionWarning && (
-        <Alert variant="warning">
-          Warning: The default base permission for this organization is&nbsp;
-          {`"${permission.charAt(0).toUpperCase() + permission.slice(1)}"`}.
-          Students may be able to view one another&apos;s private repos.&nbsp;
-          {orgName && (
-            <Alert.Link
-              href={`https://github.com/organizations/${orgName}/settings/member_privileges`}
-              target="_blank"
-              rel="noopener noreferrer"
-            >
-              Change this in GitHub settings.
-            </Alert.Link>
-          )}
-        </Alert>
-      )}
+      {false}
     </>
   );
killedBy: CourseWarningBanner tests renders permission warning with link when value is read
statusReason: Unable to find an element with the text: /default base permission for this organization/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] MethodExpression
main/components/Courses/CourseWarningBanner.jsx:34:53
       {showPermissionWarning && (
         <Alert variant="warning">
           Warning: The default base permission for this organization is&nbsp;
-          {`"${permission.charAt(0).toUpperCase() + permission.slice(1)}"`}.
+          {`"${permission.charAt(0).toUpperCase() + permission}"`}.
           Students may be able to view one another&apos;s private repos.&nbsp;
           {orgName && (
killedBy: CourseWarningBanner tests renders permission warning with link when value is read
statusReason: Unable to find an element with the text: /"Read"/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="fade alert alert-warning show"
      role="alert"

[Killed] MethodExpression
main/components/Courses/CourseWarningBanner.jsx:34:16
       {showPermissionWarning && (
         <Alert variant="warning">
           Warning: The default base permission for this organization is&nbsp;
-          {`"${permission.charAt(0).toUpperCase() + permission.slice(1)}"`}.
+          {`"${permission.charAt(0).toLowerCase() + permission.slice(1)}"`}.
           Students may be able to view one another&apos;s private repos.&nbsp;
           {orgName && (
killedBy: CourseWarningBanner tests renders permission warning with link when value is read
statusReason: Unable to find an element with the text: /"Read"/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="fade alert alert-warning show"
      role="alert"

[Killed] ConditionalExpression
main/components/Courses/CourseWarningBanner.jsx:36:12
           Warning: The default base permission for this organization is&nbsp;
           {`"${permission.charAt(0).toUpperCase() + permission.slice(1)}"`}.
           Students may be able to view one another&apos;s private repos.&nbsp;
-          {orgName && (
-            <Alert.Link
-              href={`https://github.com/organizations/${orgName}/settings/member_privileges`}
-              target="_blank"
-              rel="noopener noreferrer"
-            >
-              Change this in GitHub settings.
-            </Alert.Link>
-          )}
+          {true}
         </Alert>
       )}
killedBy: CourseWarningBanner tests renders permission warning with link when value is read
statusReason: Unable to find an accessible element with the role "link" and name `/change this in github settings/i`

Here are the accessible roles:

  alert:

  Name "":
  <div

[Killed] LogicalOperator
main/components/Courses/CourseWarningBanner.jsx:36:12
           Warning: The default base permission for this organization is&nbsp;
           {`"${permission.charAt(0).toUpperCase() + permission.slice(1)}"`}.
           Students may be able to view one another&apos;s private repos.&nbsp;
-          {orgName && (
-            <Alert.Link
-              href={`https://github.com/organizations/${orgName}/settings/member_privileges`}
-              target="_blank"
-              rel="noopener noreferrer"
-            >
-              Change this in GitHub settings.
-            </Alert.Link>
-          )}
+          {orgName || <Alert.Link href={`https://github.com/organizations/${orgName}/settings/member_privileges`} target="_blank" rel="noopener noreferrer">
+              Change this in GitHub settings.
+            </Alert.Link>}
         </Alert>
       )}
killedBy: CourseWarningBanner tests renders permission warning with link when value is read
statusReason: Unable to find an accessible element with the role "link" and name `/change this in github settings/i`

Here are the accessible roles:

  alert:

  Name "":
  <div
