[Killed] ConditionalExpression
main/components/Courses/CourseWarningBanner.jsx:21:5
 
   const permission = warnings?.defaultBasePermission;
   const showPermissionWarning =
-    permission && permission !== "none" && permission !== "null";
+    false;
 
   return (
killedBy: CourseWarningBanner tests renders permission warning with link when value is read
statusReason: Unable to find an element with the text: /default base permission for this organization/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style
