[Killed] BooleanLiteral
main/pages/Instructor/InstructorCourseShowPage.jsx:23:56
 export default function InstructorCourseShowPage() {
   const currentUser = useCurrentUser();
   const courseId = useParams().id;
-  const [showErrorModal, setShowErrorModal] = useState(false);
+  const [showErrorModal, setShowErrorModal] = useState(true);
 
   const {
killedBy: InstructorCourseShowPage tests renders correctly for instructor user
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="modal-title h4"
>
  Course Not Found
</div> instead

[Killed] ArrayDeclaration
main/pages/Instructor/InstructorCourseShowPage.jsx:31:5
     status: _statusCourse,
     failureCount: courseBackendFailureCount,
   } = useBackend(
-    [`/api/courses/${courseId}`],
+    [],
     // Stryker disable next-line StringLiteral : GET and empty string are equivalent
     { method: "GET", url: `/api/courses/${courseId}` },
killedBy: InstructorCourseShowPage tests Returns to course page on timeout
statusReason: expected undefined to be null // Object.is equality

[Killed] BooleanLiteral
main/pages/Instructor/InstructorCourseShowPage.jsx:35:5
     // Stryker disable next-line StringLiteral : GET and empty string are equivalent
     { method: "GET", url: `/api/courses/${courseId}` },
     null,
-    true,
+    false,
   );
 
killedBy: InstructorCourseShowPage tests Returns to course page on timeout
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      "Error communicating with backend via GET on /api/courses/7",

[Killed] EqualityOperator
main/pages/Instructor/InstructorCourseShowPage.jsx:38:27
     true,
   );
 
-  const getCourseFailed = courseBackendFailureCount > 0;
+  const getCourseFailed = courseBackendFailureCount >= 0;
 
   const navigate = useNavigate();
killedBy: InstructorCourseShowPage tests renders correctly for instructor user
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="modal-title h4"
>
  Course Not Found
</div> instead

[Killed] ConditionalExpression
main/pages/Instructor/InstructorCourseShowPage.jsx:38:27
     true,
   );
 
-  const getCourseFailed = courseBackendFailureCount > 0;
+  const getCourseFailed = false;
 
   const navigate = useNavigate();
killedBy: InstructorCourseShowPage tests Returns to course page on timeout
statusReason: Unable to find an element with the text: Course not found. You will be returned to the course list in 3 seconds.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BlockStatement
main/pages/Instructor/InstructorCourseShowPage.jsx:41:19
   const getCourseFailed = courseBackendFailureCount > 0;
 
   const navigate = useNavigate();
-  useEffect(() => {
-    if (getCourseFailed) {
-      setShowErrorModal(true);
-      const timer = setTimeout(() => {
-        navigate("/", { replace: true });
-      }, 3000);
-      // Stryker disable next-line BlockStatement
-      return () => {
-        clearTimeout(timer);
-      };
-    }
-  }, [getCourseFailed, navigate]);
+  useEffect(() => {}, [getCourseFailed, navigate]);
 
   const testId = "InstructorCourseShowPage";
killedBy: InstructorCourseShowPage tests Returns to course page on timeout
statusReason: Unable to find an element with the text: Course not found. You will be returned to the course list in 3 seconds.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BlockStatement
main/pages/Instructor/InstructorCourseShowPage.jsx:42:26
 
   const navigate = useNavigate();
   useEffect(() => {
-    if (getCourseFailed) {
-      setShowErrorModal(true);
-      const timer = setTimeout(() => {
-        navigate("/", { replace: true });
-      }, 3000);
-      // Stryker disable next-line BlockStatement
-      return () => {
-        clearTimeout(timer);
-      };
-    }
+    if (getCourseFailed) {}
   }, [getCourseFailed, navigate]);
 
killedBy: InstructorCourseShowPage tests Returns to course page on timeout
statusReason: Unable to find an element with the text: Course not found. You will be returned to the course list in 3 seconds.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
main/pages/Instructor/InstructorCourseShowPage.jsx:42:9
 
   const navigate = useNavigate();
   useEffect(() => {
-    if (getCourseFailed) {
+    if (false) {
       setShowErrorModal(true);
       const timer = setTimeout(() => {
killedBy: InstructorCourseShowPage tests Returns to course page on timeout
statusReason: Unable to find an element with the text: Course not found. You will be returned to the course list in 3 seconds.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BooleanLiteral
main/pages/Instructor/InstructorCourseShowPage.jsx:43:25
   const navigate = useNavigate();
   useEffect(() => {
     if (getCourseFailed) {
-      setShowErrorModal(true);
+      setShowErrorModal(false);
       const timer = setTimeout(() => {
         navigate("/", { replace: true });
killedBy: InstructorCourseShowPage tests Returns to course page on timeout
statusReason: Unable to find an element with the text: Course not found. You will be returned to the course list in 3 seconds.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BlockStatement
main/pages/Instructor/InstructorCourseShowPage.jsx:44:38
   useEffect(() => {
     if (getCourseFailed) {
       setShowErrorModal(true);
-      const timer = setTimeout(() => {
-        navigate("/", { replace: true });
-      }, 3000);
+      const timer = setTimeout(() => {}, 3000);
       // Stryker disable next-line BlockStatement
       return () => {
killedBy: InstructorCourseShowPage tests Returns to course page on timeout
statusReason: expected "vi.fn()" to be called with arguments: [ '/', { replace: true } ]

Number of calls: 0

[Killed] BooleanLiteral
main/pages/Instructor/InstructorCourseShowPage.jsx:45:34
     if (getCourseFailed) {
       setShowErrorModal(true);
       const timer = setTimeout(() => {
-        navigate("/", { replace: true });
+        navigate("/", { replace: false });
       }, 3000);
       // Stryker disable next-line BlockStatement
killedBy: InstructorCourseShowPage tests Returns to course page on timeout
statusReason: expected "vi.fn()" to be called with arguments: [ '/', { replace: true } ]

Received:

  1st vi.fn() call:

  [
    "/",

[Killed] ObjectLiteral
main/pages/Instructor/InstructorCourseShowPage.jsx:45:23
     if (getCourseFailed) {
       setShowErrorModal(true);
       const timer = setTimeout(() => {
-        navigate("/", { replace: true });
+        navigate("/", {});
       }, 3000);
       // Stryker disable next-line BlockStatement
killedBy: InstructorCourseShowPage tests Returns to course page on timeout
statusReason: expected "vi.fn()" to be called with arguments: [ '/', { replace: true } ]

Received:

  1st vi.fn() call:

  [
    "/",

[Killed] StringLiteral
main/pages/Instructor/InstructorCourseShowPage.jsx:54:18
     }
   }, [getCourseFailed, navigate]);
 
-  const testId = "InstructorCourseShowPage";
+  const testId = "";
   return (
     <BasicLayout>
killedBy: InstructorCourseShowPage tests renders correctly for instructor user
statusReason: Unable to find an element by: [data-testid="InstructorCourseShowPage-title"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ArrowFunction
main/pages/Instructor/InstructorCourseShowPage.jsx:66:28
           seconds.
         </Modal.Body>
         <Modal.Footer>
-          <Button onClick={() => setShowErrorModal(false)} variant={"primary"}>
+          <Button onClick={() => undefined} variant={"primary"}>
             Close
           </Button>
killedBy: InstructorCourseShowPage tests Returns to course page on timeout
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="modal-title h4"
>
  Course Not Found
</div> instead

[Killed] BooleanLiteral
main/pages/Instructor/InstructorCourseShowPage.jsx:66:52
           seconds.
         </Modal.Body>
         <Modal.Footer>
-          <Button onClick={() => setShowErrorModal(false)} variant={"primary"}>
+          <Button onClick={() => setShowErrorModal(true)} variant={"primary"}>
             Close
           </Button>
killedBy: InstructorCourseShowPage tests Returns to course page on timeout
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="modal-title h4"
>
  Course Not Found
</div> instead

[Killed] BooleanLiteral
main/pages/Instructor/InstructorCourseShowPage.jsx:72:8
         </Modal.Footer>
       </Modal>
       <CourseWarningBanner courseId={courseId} />
-      {!course ? (
+      {course ? (
         <div data-testid={`${testId}-loading`}>Course: Loading...</div>
       ) : (
killedBy: InstructorCourseShowPage tests renders correctly for instructor user
statusReason: Cannot read properties of null (reading 'orgName')

[Killed] StringLiteral
main/pages/Instructor/InstructorCourseShowPage.jsx:73:27
       </Modal>
       <CourseWarningBanner courseId={courseId} />
       {!course ? (
-        <div data-testid={`${testId}-loading`}>Course: Loading...</div>
+        <div data-testid={``}>Course: Loading...</div>
       ) : (
         <div className="border rounded-3 p-4 mb-4">
killedBy: InstructorCourseShowPage tests Returns to course page on timeout
statusReason: Unable to find an element by: [data-testid="InstructorCourseShowPage-loading"]

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="overflow: hidden; padding-right: 1024px;"
>

[Killed] LogicalOperator
main/pages/Instructor/InstructorCourseShowPage.jsx:77:14
       ) : (
         <div className="border rounded-3 p-4 mb-4">
           <div className="d-flex align-items-center gap-3">
-            {course.orgName && (
-              <img
-                src={`https://github.com/${course.orgName}.png?size=64`}
-                alt={course.orgName}
-                data-testid={`${testId}-github-org-image`}
-                className="rounded-circle border"
-                style={{ width: 48, height: 48 }}
-              />
-            )}
+            {course.orgName || <img src={`https://github.com/${course.orgName}.png?size=64`} alt={course.orgName} data-testid={`${testId}-github-org-image`} className="rounded-circle border" style={{
+  width: 48,
+  height: 48
+}} />}
             <div>
               <div className="d-flex align-items-center gap-2">
killedBy: InstructorCourseShowPage tests renders correctly for instructor user
statusReason: Found multiple elements with the text: ucsb-cs156-s25

Here are the matching elements:

Ignored nodes: comments, script, style
<div
  class="d-flex align-items-center gap-3"
>

[Killed] ConditionalExpression
main/pages/Instructor/InstructorCourseShowPage.jsx:77:14
       ) : (
         <div className="border rounded-3 p-4 mb-4">
           <div className="d-flex align-items-center gap-3">
-            {course.orgName && (
-              <img
-                src={`https://github.com/${course.orgName}.png?size=64`}
-                alt={course.orgName}
-                data-testid={`${testId}-github-org-image`}
-                className="rounded-circle border"
-                style={{ width: 48, height: 48 }}
-              />
-            )}
+            {false}
             <div>
               <div className="d-flex align-items-center gap-2">
killedBy: InstructorCourseShowPage tests renders correctly for instructor user
statusReason: Unable to find an element by: [data-testid="InstructorCourseShowPage-github-org-image"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
main/pages/Instructor/InstructorCourseShowPage.jsx:79:22
           <div className="d-flex align-items-center gap-3">
             {course.orgName && (
               <img
-                src={`https://github.com/${course.orgName}.png?size=64`}
+                src={``}
                 alt={course.orgName}
                 data-testid={`${testId}-github-org-image`}
killedBy: InstructorCourseShowPage tests renders correctly for instructor user
statusReason: expect(element).toHaveAttribute("src", "https://github.com/ucsb-cs156-s25.png?size=64") // element.getAttribute("src") === "https://github.com/ucsb-cs156-s25.png?size=64"

Expected the element to have attribute:
  src="https://github.com/ucsb-cs156-s25.png?size=64"
Received:
  null

[Killed] StringLiteral
main/pages/Instructor/InstructorCourseShowPage.jsx:81:30
               <img
                 src={`https://github.com/${course.orgName}.png?size=64`}
                 alt={course.orgName}
-                data-testid={`${testId}-github-org-image`}
+                data-testid={``}
                 className="rounded-circle border"
                 style={{ width: 48, height: 48 }}
killedBy: InstructorCourseShowPage tests renders correctly for instructor user
statusReason: Unable to find an element by: [data-testid="InstructorCourseShowPage-github-org-image"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
main/pages/Instructor/InstructorCourseShowPage.jsx:109:20
                   >
                     {course.orgName}
                   </a>
-                  {course.installationId && (
-                    <OverlayTrigger
-                      placement="right"
-                      overlay={
-                        <Tooltip id={`${testId}-tooltip-github-settings`}>
-                          Manage settings for association between your GitHub
-                          organization and this web application.
-                        </Tooltip>
-                      }
-                    >
-                      <a
-                        href={`https://github.com/organizations/${course.orgName}/settings/installations/${course.installationId}`}
-                        target="_blank"
-                        rel="noopener noreferrer"
-                        data-testid={`${testId}-github-settings-link`}
-                      >
-                        <GithubSettingIcon
-                          size={20}
-                          data-testid={`${testId}-github-settings-icon`}
-                        />
-                      </a>
-                    </OverlayTrigger>
-                  )}
+                  {true}
                 </div>
               )}
killedBy: InstructorCourseShowPage tests expect the correct URL to the organization for the course
statusReason: Unable to find an element by: [data-testid="InstructorCourseShowPage-github-settings-link"]

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] ConditionalExpression
main/pages/Instructor/InstructorCourseShowPage.jsx:109:20
                   >
                     {course.orgName}
                   </a>
-                  {course.installationId && (
-                    <OverlayTrigger
-                      placement="right"
-                      overlay={
-                        <Tooltip id={`${testId}-tooltip-github-settings`}>
-                          Manage settings for association between your GitHub
-                          organization and this web application.
-                        </Tooltip>
-                      }
-                    >
-                      <a
-                        href={`https://github.com/organizations/${course.orgName}/settings/installations/${course.installationId}`}
-                        target="_blank"
-                        rel="noopener noreferrer"
-                        data-testid={`${testId}-github-settings-link`}
-                      >
-                        <GithubSettingIcon
-                          size={20}
-                          data-testid={`${testId}-github-settings-icon`}
-                        />
-                      </a>
-                    </OverlayTrigger>
-                  )}
+                  {false}
                 </div>
               )}
killedBy: InstructorCourseShowPage tests expect the correct URL to the organization for the course
statusReason: Unable to find an element by: [data-testid="InstructorCourseShowPage-github-settings-link"]

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] StringLiteral
main/pages/Instructor/InstructorCourseShowPage.jsx:138:31
           </div>
         </div>
       )}
-      <Tabs defaultActiveKey={"default"}>
+      <Tabs defaultActiveKey={""}>
         <Tab eventKey={"students"} title={"Students"} className="pt-2">
           <EnrollmentTabComponent
killedBy: InstructorCourseShowPage tests Tab assertions
statusReason: expect(element).toHaveAttribute("aria-selected", "true") // element.getAttribute("aria-selected") === "true"

Expected the element to have attribute:
  aria-selected="true"
Received:
  aria-selected="false"

[Killed] StringLiteral
main/pages/Instructor/InstructorCourseShowPage.jsx:170:24
         <Tab eventKey={"jobs"} title={"Jobs"} className="pt-2">
           <JobTabComponent courseId={courseId} testIdPrefix={testId} />
         </Tab>
-        <Tab eventKey={"settings"} title={"Settings"} className="pt-2">
+        <Tab eventKey={""} title={"Settings"} className="pt-2">
           <SettingsTabComponent courseId={courseId} testIdPrefix={testId} />
         </Tab>
killedBy: InstructorCourseShowPage tests Tab assertions
statusReason: expect(element).toHaveAttribute("data-rr-ui-event-key", "settings") // element.getAttribute("data-rr-ui-event-key") === "settings"

Expected the element to have attribute:
  data-rr-ui-event-key="settings"
Received:
  data-rr-ui-event-key=""
