[Killed] BlockStatement
main/components/TabComponent/DownloadsTabComponent.jsx:3:75
 import { Button } from "react-bootstrap";
 
-export default function DownloadsTabComponent({ courseId, testIdPrefix }) {
-  const downloadStudentCsv = () => {
-    window.open(`/api/csv/rosterstudents?courseId=${courseId}`, "_blank");
-  };
-
-  return (
-    <div data-testid={`${testIdPrefix}-DownloadsTabComponent`}>
-      <Button
-        onClick={downloadStudentCsv}
-        data-testid={`${testIdPrefix}-download-student-csv-button`}
-      >
-        Download Student CSV
-      </Button>
-    </div>
-  );
-}
+export default function DownloadsTabComponent({ courseId, testIdPrefix }) {}
 
killedBy: DownloadsTabComponent Tests renders Download Student CSV button
statusReason: Unable to find an element by: [data-testid="InstructorCourseShowPage-DownloadsTabComponent"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Timeout] BlockStatement
main/components/TabComponent/DownloadsTabComponent.jsx:4:36
 import { Button } from "react-bootstrap";
 
 export default function DownloadsTabComponent({ courseId, testIdPrefix }) {
-  const downloadStudentCsv = () => {
-    window.open(`/api/csv/rosterstudents?courseId=${courseId}`, "_blank");
-  };
+  const downloadStudentCsv = () => {};
 
   return (

[Timeout] StringLiteral
main/components/TabComponent/DownloadsTabComponent.jsx:5:17
 
 export default function DownloadsTabComponent({ courseId, testIdPrefix }) {
   const downloadStudentCsv = () => {
-    window.open(`/api/csv/rosterstudents?courseId=${courseId}`, "_blank");
+    window.open(``, "_blank");
   };
 

[Killed] StringLiteral
main/components/TabComponent/DownloadsTabComponent.jsx:9:23
   };
 
   return (
-    <div data-testid={`${testIdPrefix}-DownloadsTabComponent`}>
+    <div data-testid={``}>
       <Button
         onClick={downloadStudentCsv}
killedBy: DownloadsTabComponent Tests renders Download Student CSV button
statusReason: Unable to find an element by: [data-testid="InstructorCourseShowPage-DownloadsTabComponent"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid=""
    >
