[Killed] ConditionalExpression
main/pages/Instructor/InstructorCourseShowPage.jsx:56:35
     },
   );
   const basePermission = warnings?.defaultBasePermission;
-  const showBasePermissionBadge = basePermission && basePermission !== "null";
+  const showBasePermissionBadge = false;
 
   const navigate = useNavigate();
killedBy: InstructorCourseShowPage tests renders Default Base Permission badge with value None
statusReason: Unable to find an element by: [data-testid="InstructorCourseShowPage-default-base-permission"]

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] LogicalOperator
main/pages/Instructor/InstructorCourseShowPage.jsx:152:16
                   )}
                 </div>
               )}
-              {course.orgName && showBasePermissionBadge && (
+              {course.orgName || showBasePermissionBadge && (
                 <div
                   className="text-muted small mt-1"
killedBy: InstructorCourseShowPage tests header displays correct info when course is loaded (and displays warning)
statusReason: Unable to find an element with the text: CMPSC 156. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div />

[Killed] StringLiteral
main/pages/Instructor/InstructorCourseShowPage.jsx:201:44
         <Tab eventKey={"settings"} title={"Settings"} className="pt-2">
           <SettingsTabComponent courseId={courseId} testIdPrefix={testId} />
         </Tab>
-        <Tab eventKey={"downloads"} title={"Downloads"} className="pt-2">
+        <Tab eventKey={"downloads"} title={""} className="pt-2">
           <DownloadsTabComponent courseId={courseId} testIdPrefix={testId} />
         </Tab>
killedBy: InstructorCourseShowPage tests Tab assertions
statusReason: Unable to find an element with the text: Downloads. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>
