[Survived] StringLiteral
main/pages/Student/StudentCourseShowPage.jsx:11:6
   const courseId = useParams().id;
 
   const { data: course } = useBackend(
-    [`/api/courses/${courseId}`],
+    [``],
     // Stryker disable next-line StringLiteral : GET and empty string are equivalent
     { method: "GET", url: `/api/courses/${courseId}` },

[Killed] BooleanLiteral
main/pages/Student/StudentCourseShowPage.jsx:21:8
   const testId = "StudentCourseShowPage";
   return (
     <BasicLayout>
-      {!course ? (
+      {course ? (
         <div data-testid={`${testId}-loading`}>Course: Loading...</div>
       ) : (
killedBy: StudentCourseShowPage tests renders loading state before course data arrives
statusReason: Cannot read properties of null (reading 'courseName')
