[Killed] BlockStatement
main/components/Courses/CoursesTable.jsx:20:27
     {
       header: "Course Name",
       id: "courseName",
-      cell: ({ cell }) => {
-        if (courseDetailRoute) {
-          return (
-            <Link
-              to={`${courseDetailRoute}/${cell.row.original.id}`}
-              data-testid={`${testId}-cell-row-${cell.row.index}-col-courseName-link`}
-            >
-              {cell.row.original.courseName}
-            </Link>
-          );
-        }
-        return cell.row.original.courseName;
-      },
+      cell: ({ cell }) => {},
     },
     {
killedBy: HomePageLoggedIn tests tables render correctly
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  CMPSC 156
Received:

[Killed] BlockStatement
main/components/Courses/CoursesTable.jsx:21:32
       header: "Course Name",
       id: "courseName",
       cell: ({ cell }) => {
-        if (courseDetailRoute) {
-          return (
-            <Link
-              to={`${courseDetailRoute}/${cell.row.original.id}`}
-              data-testid={`${testId}-cell-row-${cell.row.index}-col-courseName-link`}
-            >
-              {cell.row.original.courseName}
-            </Link>
-          );
-        }
+        if (courseDetailRoute) {}
         return cell.row.original.courseName;
       },
killedBy: StudentCoursesTable tests course name is a link to student course show page
statusReason: Unable to find an element by: [data-testid="CoursesTable-cell-row-0-col-courseName-link"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="CoursesTable"

[Killed] ConditionalExpression
main/components/Courses/CoursesTable.jsx:21:13
       header: "Course Name",
       id: "courseName",
       cell: ({ cell }) => {
-        if (courseDetailRoute) {
+        if (false) {
           return (
             <Link
killedBy: StudentCoursesTable tests course name is a link to student course show page
statusReason: Unable to find an element by: [data-testid="CoursesTable-cell-row-0-col-courseName-link"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="CoursesTable"

[Killed] StringLiteral
main/components/Courses/CoursesTable.jsx:58:13
       switch (studentStatus) {
         case "PENDING":
           set_message =
-            "This course has not been completely set up by your instructor yet.";
+            "";
           break;
         case "JOINCOURSE":
killedBy: CoursesTable tests tooltips for PENDING status
statusReason: Unable to find an element with the text: This course has not been completely set up by your instructor yet.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-

[Killed] StringLiteral
main/components/Courses/CoursesTable.jsx:62:13
           break;
         case "JOINCOURSE":
           set_message =
-            "Clicking this button will generate an invitation to the GitHub organization associated with this course.";
+            "";
           break;
         case "INVITED":
killedBy: CoursesTable tests tooltips for JOINCOURSE status
statusReason: 
Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="CoursesTable"

[Killed] ConditionalExpression
main/components/Courses/CoursesTable.jsx:94:13
       accessorKey: "studentStatus",
       cell: ({ cell }) => {
         const status = cell.row.original.studentStatus;
-        if (status === "PENDING") {
+        if (true) {
           return (
             <OverlayTrigger
killedBy: HomePageLoggedIn tests right message on 400
statusReason: Unable to find an element with the text: Join Course. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
main/components/Courses/CoursesTable.jsx:114:32
                 <Button
                   variant={"primary"}
                   onClick={() => joinCallback(cell)}
-                  data-testid={`${testId}-cell-row-${cell.row.index}-col-${cell.column.id}-button`}
+                  data-testid={``}
                   disabled={cellIsLoading}
                 >
killedBy: CoursesTable tests Calls joinCallback when the button is pressed
statusReason: Unable to find an element by: [data-testid="CoursesTable-cell-row-1-col-studentStatus-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="CoursesTable"
