[Killed] OptionalChaining
main/pages/Instructor/InstructorCourseShowPage.jsx:54:26
       staleTime: "static",
     },
   );
-  const basePermission = warnings?.defaultBasePermission;
+  const basePermission = warnings.defaultBasePermission;
   const showBasePermissionBadge = basePermission && basePermission !== "null";
 
killedBy: InstructorCourseShowPage tests Cleans up correctly on unmount
statusReason: Unable to find an element with the text: Course not found. You will be returned to the course list in 3 seconds.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div />

[Killed] ConditionalExpression
main/pages/Instructor/InstructorCourseShowPage.jsx:55:35
     },
   );
   const basePermission = warnings?.defaultBasePermission;
-  const showBasePermissionBadge = basePermission && basePermission !== "null";
+  const showBasePermissionBadge = true;
 
   const navigate = useNavigate();
killedBy: InstructorCourseShowPage tests header displays correct info when course is loaded (and displays warning)
statusReason: Unable to find an element with the text: CMPSC 156. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div />

[Killed] LogicalOperator
main/pages/Instructor/InstructorCourseShowPage.jsx:55:35
     },
   );
   const basePermission = warnings?.defaultBasePermission;
-  const showBasePermissionBadge = basePermission && basePermission !== "null";
+  const showBasePermissionBadge = basePermission || basePermission !== "null";
 
   const navigate = useNavigate();
killedBy: InstructorCourseShowPage tests header displays correct info when course is loaded (and displays warning)
statusReason: Unable to find an element with the text: CMPSC 156. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div />

[Killed] OptionalChaining
main/pages/Instructor/InstructorCourseShowPage.jsx:88:57
           </Button>
         </Modal.Footer>
       </Modal>
-      <CourseWarningBanner courseId={courseId} orgName={course?.orgName} />
+      <CourseWarningBanner courseId={courseId} orgName={course.orgName} />
       {!course ? (
         <div data-testid={`${testId}-loading`}>Course: Loading...</div>
killedBy: InstructorCourseShowPage tests renders correctly for instructor user
statusReason: Cannot read properties of null (reading 'orgName')

[Killed] BooleanLiteral
main/pages/Instructor/InstructorCourseShowPage.jsx:89:8
         </Modal.Footer>
       </Modal>
       <CourseWarningBanner courseId={courseId} orgName={course?.orgName} />
-      {!course ? (
+      {course ? (
         <div data-testid={`${testId}-loading`}>Course: Loading...</div>
       ) : (
killedBy: InstructorCourseShowPage tests renders correctly for instructor user
statusReason: Cannot read properties of null (reading 'orgName')

[Killed] StringLiteral
main/pages/Instructor/InstructorCourseShowPage.jsx:130:38
                     <OverlayTrigger
                       placement="right"
                       overlay={
-                        <Tooltip id={`${testId}-tooltip-github-settings`}>
+                        <Tooltip id={``}>
                           Manage settings for association between your GitHub
                           organization and this web application.
killedBy: InstructorCourseShowPage tests expect the correct tooltip ID and message for the github icon (that redirects to github installation settings)
statusReason: expect(element).toHaveAttribute("id", "InstructorCourseShowPage-tooltip-github-settings") // element.getAttribute("id") === "InstructorCourseShowPage-tooltip-github-settings"

Expected the element to have attribute:
  id="InstructorCourseShowPage-tooltip-github-settings"
Received:
  id=""

[Killed] ConditionalExpression
main/pages/Instructor/InstructorCourseShowPage.jsx:151:16
                   )}
                 </div>
               )}
-              {course.orgName && showBasePermissionBadge && (
-                <div
-                  className="text-muted small mt-1"
-                  data-testid={`${testId}-default-base-permission`}
-                >
-                  Default Base Permission:{" "}
-                  {basePermission.charAt(0).toUpperCase() +
-                    basePermission.slice(1)}
-                </div>
-              )}
+              {false}
             </div>
           </div>
killedBy: InstructorCourseShowPage tests renders Default Base Permission badge with value None
statusReason: Unable to find an element by: [data-testid="InstructorCourseShowPage-default-base-permission"]

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] LogicalOperator
main/pages/Instructor/InstructorCourseShowPage.jsx:151:16
                   )}
                 </div>
               )}
-              {course.orgName && showBasePermissionBadge && (
-                <div
-                  className="text-muted small mt-1"
-                  data-testid={`${testId}-default-base-permission`}
-                >
-                  Default Base Permission:{" "}
-                  {basePermission.charAt(0).toUpperCase() +
-                    basePermission.slice(1)}
-                </div>
-              )}
+              {course.orgName && showBasePermissionBadge || <div className="text-muted small mt-1" data-testid={`${testId}-default-base-permission`}>
+                  Default Base Permission:{" "}
+                  {basePermission.charAt(0).toUpperCase() + basePermission.slice(1)}
+                </div>}
             </div>
           </div>
killedBy: InstructorCourseShowPage tests header displays correct info when course is loaded (and displays warning)
statusReason: Unable to find an element with the text: CMPSC 156. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div />

[Killed] StringLiteral
main/pages/Instructor/InstructorCourseShowPage.jsx:154:32
               {course.orgName && showBasePermissionBadge && (
                 <div
                   className="text-muted small mt-1"
-                  data-testid={`${testId}-default-base-permission`}
+                  data-testid={``}
                 >
                   Default Base Permission:{" "}
killedBy: InstructorCourseShowPage tests renders Default Base Permission badge with value None
statusReason: Unable to find an element by: [data-testid="InstructorCourseShowPage-default-base-permission"]

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] ArithmeticOperator
main/pages/Instructor/InstructorCourseShowPage.jsx:157:20
                   data-testid={`${testId}-default-base-permission`}
                 >
                   Default Base Permission:{" "}
-                  {basePermission.charAt(0).toUpperCase() +
-                    basePermission.slice(1)}
+                  {basePermission.charAt(0).toUpperCase() - basePermission.slice(1)}
                 </div>
               )}
killedBy: InstructorCourseShowPage tests renders Default Base Permission badge with value None
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Default Base Permission: None
Received:
  Default Base Permission: NaN

[Killed] MethodExpression
main/pages/Instructor/InstructorCourseShowPage.jsx:157:20
                   data-testid={`${testId}-default-base-permission`}
                 >
                   Default Base Permission:{" "}
-                  {basePermission.charAt(0).toUpperCase() +
+                  {basePermission.charAt(0).toLowerCase() +
                     basePermission.slice(1)}
                 </div>
killedBy: InstructorCourseShowPage tests renders Default Base Permission badge with value None
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Default Base Permission: None
Received:
  Default Base Permission: none

[Killed] MethodExpression
main/pages/Instructor/InstructorCourseShowPage.jsx:158:21
                 >
                   Default Base Permission:{" "}
                   {basePermission.charAt(0).toUpperCase() +
-                    basePermission.slice(1)}
+                    basePermission}
                 </div>
               )}
killedBy: InstructorCourseShowPage tests renders Default Base Permission badge with value None
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Default Base Permission: None
Received:
  Default Base Permission: Nnone

[Killed] StringLiteral
main/pages/Instructor/InstructorCourseShowPage.jsx:166:43
         </div>
       )}
       <Tabs defaultActiveKey={"default"}>
-        <Tab eventKey={"students"} title={"Students"} className="pt-2">
+        <Tab eventKey={"students"} title={""} className="pt-2">
           <EnrollmentTabComponent
             courseId={courseId}
killedBy: InstructorCourseShowPage tests Tab assertions
statusReason: Unable to find an element with the text: Students. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] StringLiteral
main/pages/Instructor/InstructorCourseShowPage.jsx:194:39
             currentUser={currentUser}
           />
         </Tab>
-        <Tab eventKey={"jobs"} title={"Jobs"} className="pt-2">
+        <Tab eventKey={"jobs"} title={""} className="pt-2">
           <JobTabComponent courseId={courseId} testIdPrefix={testId} />
         </Tab>
killedBy: InstructorCourseShowPage tests Tab assertions
statusReason: Unable to find an element with the text: Jobs. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] StringLiteral
main/pages/Instructor/InstructorCourseShowPage.jsx:194:24
             currentUser={currentUser}
           />
         </Tab>
-        <Tab eventKey={"jobs"} title={"Jobs"} className="pt-2">
+        <Tab eventKey={""} title={"Jobs"} className="pt-2">
           <JobTabComponent courseId={courseId} testIdPrefix={testId} />
         </Tab>
killedBy: InstructorCourseShowPage tests Tab assertions
statusReason: expect(element).toHaveAttribute("data-rr-ui-event-key", "jobs") // element.getAttribute("data-rr-ui-event-key") === "jobs"

Expected the element to have attribute:
  data-rr-ui-event-key="jobs"
Received:
  data-rr-ui-event-key=""
