[Killed] StringLiteral
main/components/TabComponent/StaffTabComponent.jsx:64:62
   };
 
   const downloadCsv = () => {
-    window.open(`/api/csv/coursestaff?courseId=${courseId}`, "_blank");
+    window.open(`/api/csv/coursestaff?courseId=${courseId}`, "");
   };
 
killedBy: StaffTabComponent Tests Download Staff CSV button calls window.open with correct URL
statusReason: expected "vi.fn()" to be called with arguments: [ …(2) ]

Received:

  1st vi.fn() call:

  [
    "/api/csv/coursestaff?courseId=7",

[Killed] ConditionalExpression
main/components/TabComponent/StaffTabComponent.jsx:95:10
         </ModalBody>
       </Modal>
       <Row sm={3} className="p-2">
-        {isInstructor && (
-          <Col>
-            <OverlayTrigger placement="top" overlay={renderComingSoonTooltip}>
-              <span className="d-inline-block w-100">
-                <Button
-                  data-testid={`${testIdPrefix}-csv-button`}
-                  className="w-100 button btn-secondary disabled"
-                  disabled
-                  style={{ pointerEvents: "none" }}
-                  aria-disabled="true"
-                >
-                  Upload CSV Roster
-                </Button>
-              </span>
-            </OverlayTrigger>
-          </Col>
-        )}
+        {false}
         {isInstructor && (
           <Col>
killedBy: StaffTabComponent Tests for coming soon tooltip on disabled upload CSV button
statusReason: Unable to find an element by: [data-testid="InstructorCourseShowPage-csv-button"]

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] LogicalOperator
main/components/TabComponent/StaffTabComponent.jsx:95:10
         </ModalBody>
       </Modal>
       <Row sm={3} className="p-2">
-        {isInstructor && (
-          <Col>
-            <OverlayTrigger placement="top" overlay={renderComingSoonTooltip}>
-              <span className="d-inline-block w-100">
-                <Button
-                  data-testid={`${testIdPrefix}-csv-button`}
-                  className="w-100 button btn-secondary disabled"
-                  disabled
-                  style={{ pointerEvents: "none" }}
-                  aria-disabled="true"
-                >
-                  Upload CSV Roster
-                </Button>
-              </span>
-            </OverlayTrigger>
-          </Col>
-        )}
+        {isInstructor || <Col>
+            <OverlayTrigger placement="top" overlay={renderComingSoonTooltip}>
+              <span className="d-inline-block w-100">
+                <Button data-testid={`${testIdPrefix}-csv-button`} className="w-100 button btn-secondary disabled" disabled style={{
+        pointerEvents: "none"
+      }} aria-disabled="true">
+                  Upload CSV Roster
+                </Button>
+              </span>
+            </OverlayTrigger>
+          </Col>}
         {isInstructor && (
           <Col>
killedBy: StaffTabComponent Tests for coming soon tooltip on disabled upload CSV button
statusReason: Unable to find an element by: [data-testid="InstructorCourseShowPage-csv-button"]

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] ConditionalExpression
main/components/TabComponent/StaffTabComponent.jsx:112:10
             </OverlayTrigger>
           </Col>
         )}
-        {isInstructor && (
-          <Col>
-            <Button
-              onClick={() => showPostModal(true)}
-              data-testid={`${testIdPrefix}-post-button`}
-              className="w-100"
-            >
-              Add Staff Member
-            </Button>
-          </Col>
-        )}
+        {false}
         <Col>
           <div className="d-flex align-items-center position-relative">
killedBy: StaffTabComponent Tests StaffForm submit works and clears search filter
statusReason: Unable to find an element by: [data-testid="InstructorCourseShowPage-post-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="InstructorCourseShowPage-StaffTabComponent"
    >

[Killed] LogicalOperator
main/components/TabComponent/StaffTabComponent.jsx:112:10
             </OverlayTrigger>
           </Col>
         )}
-        {isInstructor && (
-          <Col>
-            <Button
-              onClick={() => showPostModal(true)}
-              data-testid={`${testIdPrefix}-post-button`}
-              className="w-100"
-            >
-              Add Staff Member
-            </Button>
-          </Col>
-        )}
+        {isInstructor || <Col>
+            <Button onClick={() => showPostModal(true)} data-testid={`${testIdPrefix}-post-button`} className="w-100">
+              Add Staff Member
+            </Button>
+          </Col>}
         <Col>
           <div className="d-flex align-items-center position-relative">
killedBy: StaffTabComponent Tests StaffForm submit works and clears search filter
statusReason: Unable to find an element by: [data-testid="InstructorCourseShowPage-post-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="InstructorCourseShowPage-StaffTabComponent"
    >

[Killed] StringLiteral
main/components/TabComponent/StaffTabComponent.jsx:127:28
           <div className="d-flex align-items-center position-relative">
             <Button
               onClick={downloadCsv}
-              data-testid={`${testIdPrefix}-download-csv-button`}
+              data-testid={``}
               className="w-100 pe-5"
             >
killedBy: StaffTabComponent Tests Download Staff CSV button calls window.open with correct URL
statusReason: Unable to find an element by: [data-testid="InstructorCourseShowPage-download-csv-button"]

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>
