[Killed] ConditionalExpression
src/main/pages/HomePageLoggedIn.jsx:140:10
         )}
         <h1>Your Student Courses</h1>
         <StudentCoursesTable testid={"CoursesTable"} />
-        {staffCourses.length > 0 && (
-          <>
-            <h1>Your Staff Courses</h1>
-            <CoursesTable
-              courses={staffCourses}
-              testId={"StaffCoursesTable"}
-              joinCallback={joinStaffCourseCallback}
-              isLoading={isStaffJoining}
-              courseDetailRoute="/staff/courses"
-            />
-          </>
-        )}
+        {true}
       </div>
     </BasicLayout>
killedBy: HomePageLoggedIn tests right message on 400
statusReason: Unable to find an element by: [data-testid="StaffCoursesTable-cell-row-1-col-studentStatus-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
