[Killed] StringLiteral
main/pages/Staff/StaffCourseShowPage.jsx:24:6
   const [showErrorModal, setShowErrorModal] = useState(false);
 
   const { data: course, failureCount: courseBackendFailureCount } = useBackend(
-    [`/api/courses/${courseId}`],
+    [``],
     // Stryker disable next-line StringLiteral : GET and empty string are equivalent
     { method: "GET", url: `/api/courses/${courseId}` },
killedBy: StaffCourseShowPage tests Returns to course page on timeout
statusReason: expected undefined to be null // Object.is equality

[Killed] ArrayDeclaration
main/pages/Staff/StaffCourseShowPage.jsx:24:5
   const [showErrorModal, setShowErrorModal] = useState(false);
 
   const { data: course, failureCount: courseBackendFailureCount } = useBackend(
-    [`/api/courses/${courseId}`],
+    [],
     // Stryker disable next-line StringLiteral : GET and empty string are equivalent
     { method: "GET", url: `/api/courses/${courseId}` },
killedBy: StaffCourseShowPage tests Returns to course page on timeout
statusReason: expected undefined to be null // Object.is equality

[Killed] StringLiteral
main/pages/Staff/StaffCourseShowPage.jsx:47:18
     }
   }, [getCourseFailed, navigate]);
 
-  const testId = "StaffCourseShowPage";
+  const testId = "";
   return (
     <BasicLayout>
killedBy: StaffCourseShowPage tests renders correctly for instructor user
statusReason: Unable to find an element by: [data-testid="StaffCourseShowPage-title"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
main/pages/Staff/StaffCourseShowPage.jsx:144:56
             courseId={courseId}
             testIdPrefix={testId}
             currentUser={currentUser}
-            isInstructor={Boolean(hasRole(currentUser, "ROLE_INSTRUCTOR"))}
+            isInstructor={Boolean(hasRole(currentUser, ""))}
           />
         </Tab>
killedBy: StaffCourseShowPage tests Add Staff Member button is visible for instructor users
statusReason: Unable to find role="button" and name "Add Staff Member"

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>
