[Killed] BlockStatement
main/components/Courses/CoursesTable.jsx:20:27
     {
       header: "Course Name",
       accessorKey: "courseName",
-      cell: ({ cell }) => {
-        if (courseDetailRoute) {
-          return (
-            <Link
-              to={`${courseDetailRoute}/${cell.row.original.id}`}
-              data-testid={`${testId}-cell-row-${cell.row.index}-col-courseName-link`}
-            >
-              {cell.getValue()}
-            </Link>
-          );
-        }
-        return cell.getValue();
-      },
+      cell: ({ cell }) => {},
     },
     {
killedBy: HomePageLoggedIn tests tables render correctly
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  CMPSC 156
Received:

[Killed] BlockStatement
main/components/Courses/CoursesTable.jsx:21:32
       header: "Course Name",
       accessorKey: "courseName",
       cell: ({ cell }) => {
-        if (courseDetailRoute) {
-          return (
-            <Link
-              to={`${courseDetailRoute}/${cell.row.original.id}`}
-              data-testid={`${testId}-cell-row-${cell.row.index}-col-courseName-link`}
-            >
-              {cell.getValue()}
-            </Link>
-          );
-        }
+        if (courseDetailRoute) {}
         return cell.getValue();
       },
killedBy: HomePageLoggedIn tests staff course name is a link to staff course show page
statusReason: Unable to find an element by: [data-testid="StaffCoursesTable-cell-row-0-col-courseName-link"]

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>
