[Killed] BlockStatement
main/components/TabComponent/DownloadsTabComponent.jsx:8:34
     window.open(`/api/csv/rosterstudents?courseId=${courseId}`, "_blank");
   };
 
-  const downloadTeamsCsv = () => {
-    window.open(`/api/csv/teams?courseId=${courseId}`, "_blank");
-  };
+  const downloadTeamsCsv = () => {};
 
   return (
killedBy: DownloadsTabComponent Tests clicking Download Teams CSV opens the correct URL
statusReason: expected "bound " to be called with arguments: [ '/api/csv/teams?courseId=42', …(1) ]

Number of calls: 0

[Killed] StringLiteral
main/components/TabComponent/DownloadsTabComponent.jsx:9:17
   };
 
   const downloadTeamsCsv = () => {
-    window.open(`/api/csv/teams?courseId=${courseId}`, "_blank");
+    window.open(``, "_blank");
   };
 
killedBy: DownloadsTabComponent Tests clicking Download Teams CSV opens the correct URL
statusReason: expected "bound " to be called with arguments: [ '/api/csv/teams?courseId=42', …(1) ]

Received:

  1st bound  call:

  [
-   "/api/csv/teams?courseId=42",
